{"data":{"markdownRemark":{"html":"<hr>\n<p>Mi nombre es Victor, tengo 41 años y hace poco más de un año, decidí transformarme en un Desarrollador Web.\nToda la vida me ha gustado la tecnología, los computadores y el software. Cuando era pequeño, el acceso a las consolas o los computadores para mí y mi familia era prohibitivo, y lo más cercano que estaba a mi alcance era en casa de mis conocidos, en esos tiempos un moderno Atari 800XL. Ahí vi mis primeros juegos y como una \"tortuga\" se movía por la pantalla dibujando figuras geométricas gracias al lenguaje LOGO. Eso me maravilló y siempre soñé en aprender más sobre esa novedosa tecnología.</p>\n<p><img src=\"https://cdn-images-1.medium.com/max/800/1*aYahgsxZQBBpN_tR_juvsA.jpeg\" alt=\"El famoso Atari 800XL, con su cassetera\"></p>\n<p>El famoso ATARI 800XL y su Casetera (fuente: retroinvaders)</p>\n<h2>La Sala de Computación</h2>\n<p>Un par de años después, eso se comenzó a materializar, tuve la suerte de llegar a un colegio que poseía la primera sala de computación de la zona. El año era 1989. La sala de computadores poseía 12 computadores ATARI 800XL, cada uno equipado con su Televisor individual y casetera que permitía grabar los programas que creábamos, más un computador para el profesor, que contaba con una Disketera de 5/8\", esa maravilla de la tecnología permitía cargar BASIC en todos los computadores en cosa de segundos y no minutos, que era lo que tomaba hacer lo mismo con las caseteras. En esa escuela, en los dos años que estuve aprendimos los primeros conceptos de BASIC, primero ejercicios de aritmética y luego programas más avanzados con generación de patrones de color, posición de datos en pantalla e imprimir. Amaba ir al colegio y esperaba con ansias los días que teníamos clase de computación.\nGracias a mi interés y al apoyo de mis padres, seguí aprendiendo computación con clases extracurriculares, así es como estuve dos años aprendiendo lo básico del uso de procesadores de texto (WordStar, WordPerfect), planillas de cálculo (Lotus 1–2–3), bases de datos (dBase) y programación (BASIC).\nAños Oscuros\nLuego pasé por una laguna, de varios años, donde sólo tuve acceso a PC en casa de amigos y todo principalmente para jugar y no como herramienta. Si bien la informática me apasionaba, no lo hizo al nivel de ser un incentivo para elegir una carrera profesional, y es así que en vez de estudiar ciencias de la computación, me decidí por la ingeniería bioquímica, porque las ciencias en general me encantan, y la carrera de ingeniería en informática en esos años estaba mucho más orientada a los temas de redes y telecomunicaciones, y no tanto al desarrollo de aplicaciones o a la programación, que era lo que me gustaba. Transcurría el año 1995, y mi suerte cambió, entré a la universidad y mi padres hicieron el esfuerzo y tuve mi primer computador personal. Recién estaban llegando los primeros Intel Pentium II, pero en ese momento aún eran un lujo, por lo que tuve que optar a un Pentium MMX de 200 MHz, con 32 Mb en Ram, 2 Gb de Disco Duro, una tarjeta de video dedicada ATI de 2Mb de memoria, y un voluminoso monitor de 17\" con resolución de 1024 por 768. Era una real joya, y a mí me encantaba.\nNo es el mismo, pero era así, tal cual (fuente: PBClub)En esos años el PC tenía dos funciones principales, el ser mi herramienta de trabajo y estudio, donde principalmente me dedicaba al uso de Office y Software para análisis de Datos como Origin, y algo de programación, pero muy poco, principalmente asociado al uso de Macros en Excel usando Visual Basic.\nCon los años mi gusto por la computación continuó, pero como un hobby, me dediqué a armar computadores para mis amigos y más de alguna vez lo hice para generar algo de ingresos, como siempre, era un gusto, una pasión, pero nunca le dediqué el tiempo y el esfuerzo a ello.\nPasaron los años, y me alejé de la informática, demasiado tiempo dedicado al trabajo, a viajar a terreno y el tiempo que me quedaba lo dedicaba a la vida social, a formar familia y a todo lo que ello conlleva. Es así como con el tiempo todo el tema se enfrió y a lo más me transformé en un usuario. Con el tiempo desarrollé algunos hobbies y eso me volvió a acercar a la computación, pero como ya mencioné, principalmente como usuario, esta vez ya no por el lado del PC Windows, sino que como usuario del ecosistema Mac. Es así como me dediqué a la fotografía y aprendí a usar Photoshop y Lightroom. Tuve mi canal de Youtube (el que quiero revivir) y aprendí a editar video y audio con Audacity, Final Cut Pro X, Plural Eyes, Adobe Premier Pro, etc. Transcurría entonces el año 2016.\nEs acá donde algo pasó, luego de trabajar 11 años en una empresa de ingeniería, y de haber pasado desde ingeniero junior hasta gerente de área, de vivir cómodamente sin preocupaciones financieras importantes, llegó la crisis del cobre en Chile, esto comenzó en el 2014, la empresa pudo manejar esta crisis hasta fines de 2015, dónde las finanzas ya no daban y los llevó a realizar un corte de personal importante, que finalmente me impactó a mí.\nLos primeros meses fueron tranquilos, pues si bien tenía ahorros y la indemnización, que me permitían vivir una buena cantidad de meses sin apuros económicos. Comencé a notar que las oportunidades laborales en mi área estaban cada vez más lejanas. El optar a cargos de nivel gerencial y sueldos de esa misma escala se veía cada vez más lejano y difícil. Decidí invertir y buscar nuevos nichos de trabajo, y así fue que puse una productora, y posteriormente un sitio web de divulgación científica. Esto último fue lo que gatilló todo, pues decidí que el sitio lo haría yo, años atrás ya había hecho uno que otro sitio web para amigos usando Dreamweaver o FrontPage (año 2000–2001!!), qué tan difícil podía ser.\nTantas dudas!!\nAsí empezó la búsqueda de conocimiento, por la necesidad de aprender. Cómo lo hago para tener un sitio web? Dónde compro un dominio? Qué extensión uso, .com, .cl? GoDaddy, Namecheap, Nic.cl? Cuáles son las injerencias de esa decisión? Tengo que pagar por hosting? Que es eso de las DNS? Qué es un CMS? Wordpress, Wix, o Squarespace? No me gusta el estilo por defecto, puedo cambiarlo yo? Es necesario comprar un Template? Qué es eso de PHP? Quiero un correo con mi dominio!! Cómo mantengo el sitio? Nuevos usuarios? Comentarios a las publicaciones? Que sean como en Facebook?!\nMuchas preguntas, demasiadas respuestas distintas, y poco tiempo para implementar y ajustar todo.\nEl camino del aprendizaje.\nDe a poco fui aprendiendo, decidí irme por Wordpress, comprar un template en themeforest, contratar un diseñador para que me hiciera un logo y me ayudara con la paleta de colores, compré dominio .com y me lancé.\nTenía que hacer de todo, pero de a poco me fui dedicando más y más en el sitio, vi que Wordpress me permitía modificar los estilos en una sección dónde podría escribir mi propio CSS.\nOk, CSS, de qué se trata? Busqué donde aprender, y comenzaron a aparecer nuevos conceptos. Front-End, Back-End, UI/UX Designer. HTML, CSS, Javascript.\nJavascript? Tiene algo que ver con JAVA?\nY bueno, como a mí me gusta documentarme y aprender antes de hacer cualquier cosa nueva, me puse a buscar recursos de aprendizaje.\nCodeCademy\nTreeHouse\nCoursera</p>\n<p>Estos fueron los primeros que aparecieron y que estaban bien documentados, el primero con un plan gratis que me pareció súper interesante, y es así como me puse a estudiar lo que correspondía a Front-End Developer. Estos fueron mis primeros pasos con HTML, CSS y Javascript. Hice mis primeros proyectos, muy sencillos y me gustó mucho, lo suficiente como para pagar por el curso Front End Completo. En poco menos de dos meses lo había terminado, había hecho aproximadamente 9 proyectos FrontEnd, en general sencillos, aplicando los conceptos básicos todo muy formal y muy de seguir el tutorial, replicar los pasos y llegar al resultado que se veía en el Video. Esto me gustó, pero en el fondo sentí que necesitaba más, quería aprender sobre el Desarrollo Web pero a un nivel más profundo. Me puse a buscar cursos en línea, pero todos eran de la misma naturaleza de CodeCademy, tutoriales y videos y seguir lo que dice paso a paso.\nTípica foto de un Web Developer Bootcamp (Fuente: TIC.it)Encontré entonces la mejor alternativa, con resultados garantizados, los famosos Bootcamps, entre 3 a 6 meses de estudios intensivos sobre programación, y el concepto del Full Stack, aprendías Front-End, Back-End y UI/UX Design todo en uno, e incluso antes de terminar, era posible que ya estuvieras trabajando para una importante firma de desarrollo web o de software, o si eras lo suficientemente afortunado, para algunos de los grandes, Google, Microsoft, Amazon tal vez! Un sueño hecho realidad!!\nPero soy latino, vivo en Chile y eso acá no existe. Lo más parecido son los cursos de la universidad o clases en institutos profesionales, donde en 2 años te preparan en lo básico y sales programando en Visual Basic, C o tal vez Fortran IV. Nada realmente útil.\nQué otra cosa puedo hacer? Compré un par de libros, descargué otros cuantos, pero el aprendizaje se me hacía lento y tedioso, hasta que encontré FreeCodeCamp.\nLa página del canal de Youtube de FreeCodeCampFreeCodeCamp no es como CodeCademy, acá los contenidos van apareciendo de manera paulatina, pero en vez de guiarte en los proyectos paso a paso, te entregan los conceptos y tienes la opción de probarlos de inmediato, con un pequeño desafío para aplicar el conocimiento nuevo y si lo completas, se desbloquea el paso a la siguiente etapa. Esto te garantiza que el aprendizaje sea paso a paso, y puedas ir avanzando a tu ritmo, pero aplicando inmediatamente lo que aprendes. Ahora, si no lo entiendes, tienes la oportunidad de aplicar el concepto de \"Leer-Buscar-Preguntar\", que en el fondo te ayuda a ser un programador autosuficiente, pero te enseñan que no necesariamente tienes que saber todo, sino que saber dónde buscar y a quién preguntar.\nYo hice el curso casi completo de Front-End-Developer, en la versión anterior de FreeCodeCamp, hace un par de meses cambiaron el curriculum y lo dividieron en más partes y agregaron muchísimos desafíos en muchas áreas distintas. Son literalmente miles de desafíos y cientos de horas de aprendizaje, de la mayor calidad y gratis. Para mí ha sido un recurso muy importante y me ha permitido aprender y practicar al mismo tiempo.\nHoy ya tengo mi certificación en Responsive Web Design, estoy terminando la de Javascript Algorithms And Data Structures , y estoy a medio andar de la certificación de Front End Libraries.\nEn paralelo conseguí mi primer trabajo como Freelance para una pequeña compañía de Desarrollo Web en California, ellos trabajan con Wordpress y para poder ayudar aprendí lo básico de PHP, estuve trabajando un par de meses sin recibir pago, pero me permitió trabajar en proyectos reales, para clientes reales, cosa que es de mucha ayuda.\nHoy, sigo con mi sueño de ser un Desarrollador Web, quiero hacer PWA y para ells sigo estudiando, hoy uso otro recurso junto a FreeCodeCamp, Udemy y sus miles de cursos y es ahí donde estoy aprendiendo React y React Native. Luego quiero aprender algo de Angular y Python.\nCon el tiempo las cosas han mejorado, encontré un trabajo estable y hoy volví a ejercer mi profesión para una empresa grande, no soy gerente, pero al menos tengo el tiempo y el espacio para poder hacer otras cosas.\nSeguiré estudiando, lo más que pueda, y aprendiendo lo que sea necesario, quiero ser Desarrollador Web, ser Freelancer o trabajar en una empresa grande, y desarrollarme. Si, hoy tengo más de 40, pero creo que nunca es tarde para aprender algo nuevo y reinventarse, soy muy voluntarioso y dedicado, aprendo fácil y me enfoco mucho en mis objetivos, y creo que aún tengo mucho que aportar, en particular en este mercado donde la edad de los Desarrolladores es mucho menos que la mía, pero bueno creo que mi experiencia general es un plus y no una carga. Mi camino en la programación comenzó hace un tiempo, y no quiero que se detenga, tengo mucho que aprender y una que otra cosa que enseñar.\nQuiero compartir mi ruta, documentarla, compartir las respuestas que he ido encontrando a todas las preguntas que me han surgido y a publicar nuevas preguntas, que espero un día pueda responder.\nUna cosa más, el idioma es una limitante, es una barrera de entrada que tenemos los latinos, los lenguajes tienden a ser todos relativamente semánticos para un angloparlante, pero para nosotros no es tan sencillo, yo tengo la suerte de haber aprendido inglés en mi trabajo anterior, lo hablo y lo escribo bien, pero si no has tenido esa suerte, te aconsejo aprender lo básico. Te va a facilitar mucho el poder avanzar y entender los lenguajes, y en el fondo, te va a aplanar el camino para progresar más rápidamente.</p>","frontmatter":{"path":"/first-post","title":"Devéloper a los 40…"}}},"pageContext":{}}